tutorials/neoIcoFoam/stretchedVortex/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    sides
    {
        type            zeroGradient;
    }

    // Fixing p on the two outflow patches pins the pressure level, so no
    // pRefCell is needed.
    top
    {
        type            fixedValue;
        value           uniform 0;
    }

    bottom
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
